<?php


class Adress
{


    private static $regions = array(
    "Московская область" => array("Москва", "Зеленоград", "Красногорск"),
    "Санкт-Петербург" => array("Санкт-Петербург"),
    "Краснодарский край" => array("Краснодар", "Сочи", "Анапа"),
    "Челябинская область" => array("Челябинск", "Златоуст"),
        // Добавьте другие регионы и города по вашему выбору
    );

    public static function getAdress()
    {
        $randomRegion = array_rand(Adress::$regions);
        $randomCity = Adress::$regions[$randomRegion][array_rand(Adress::$regions[$randomRegion])];
//
//        echo "Случайный регион: " . $randomRegion . "<br>";
//        echo "Входящий в него город: " . $randomCity;

        return $randomRegion . " " . $randomCity;
    }



//    public static $regions = ["Республика Адыгея", "Республика Бурятия", "Республика Алтай", "Республика Дагестан",
//        "Республика Ингушетия", "Кабардино-Балкарская Республика", "Республика Калмыкия",
//        "Карачаево-Черкесская Республика", "Республика Карелия", "Республика Коми", "Республика Марий Эл",
//        "Республика Мордовия", "Республика Саха (Якутия)", "Республика Северная Осетия-Алания",
//        "Республика Тыва", "Удмуртская Республика", "Республика Хакасия", "Чувашская Республика",
//        "Ставропольский край", "Хабаровский край"];
//
//
//    public function getRegion()
//    {
//        $mass = ["Республика Адыгея ", "Республика Бурятия ", "Республика Алтай ", "Республика Дагестан ",
//            "Республика Ингушетия ", "Кабардино-Балкарская Республика ", "Республика Калмыкия ",
//            "Карачаево-Черкесская Республика ", "Республика Карелия ", "Республика Коми ", "Республика Марий Эл ",
//            "Республика Мордовия ", "Республика Саха (Якутия) ", "Республика Северная Осетия-Алания ",
//            "Республика Тыва ", "Удмуртская Республика ", "Республика Хакасия ", "Чувашская Республика ",
//            "Ставропольский край ", "Хабаровский край "];
////        return $mass[rand(0, 19)];
//        return $mass[rand(0, (count($mass) - 1))];
//    }
//
//
//    public function getCity()
//    {
//        $mass = ["Майкоп", "Горно-Алтайск", "Уфа", "Улан-Удэ", "Махачкала", "Нальчик", "Петразоводск", "Сыктывкар",
//            "Йошкар-Ола", "Саранск", "Якутск", "Владикавказ", "Казань", "Кызыл", "Ижевск", "Абакан", "Грозный",
//            "Чебоксары", "Барнаул", "Чита", "Петропавловск-Камчатский", "Краснодар", "Красноярск", "Пермь",
//            "Ставрополь", "Хабаровск", "Благовещенск", "Архангельск", "Астрахань", "Белгород", "Брянск", "Владимир",
//            "Волгоград", "Вологда", "Воронеж", "Иваново", "Иркутск", "Калининград", "Калуга", "Кемерово", "Киров",
//            "Кострома", "Курган", "Курск", "Липецк", "Магадан", "Москва", "Мурманск", "Нижний Новгород",
//            "Великий Новгород", "Новосибирск", "Омск", "Оренбург", "Орел", "Пенза", "Псков", "Ростов-на-Дону",
//            "Рязань", "Самара", "Саратов", "Южно-Сахалинск", "Екатеринбург", "Смоленск", "Тамбов", "Тверь", "Томск",
//            "Тула", "Тюмень", "Ульяновск", "Челябинск", "Ярославль", "Нарьян-Мар", "Ханты-Мансийск", "Анадырь",
//            "Салехард", "Биробиджан", "Москва"];
//
//        return $mass[rand(0, (count($mass) - 1))];
//    }
//
//
//    public function getStreet()
//    {
//        $mass = ["ул. Ленина", "ул. Пушкина", "ул. Труда", "ул. Молодогвардейцев", "ул. Кирова", "ул. Вавилова", "ул. Павлова", "ул. Семенова",
//            "пр-кт Мира", "ул. Рижская", "ул. Павших революционеров"];
//
//        return $mass[rand(0, (count($mass) - 1))];
//    }
//    return $mass[rand(0, (count($mass) - 1))];
}