<?php


class Adress
{


    private static $regions = array(
    "Московская область" => array("Балашиха", "Подольск", "Химки", "Мытищи", "Королёв", "Люберцы", "Красногорск",
        "Электросталь", "Коломна", "Домодедово", "Одинцово", "Серпухов", "Щёлково", "Раменское", "Орехово-Зуево",
        "Долгопрудный", "Реутов", "Пушкино", "Жуковский", "Ногинск", "Сергиев Посад", "Воскресенск", "Лобня",
        "Ивантеевка", "Клин", "Видное", "Дубна", "Егорьевск", "Чехов", "Дмитров", "Ступино", "Наро-Фоминск",
        "Павловский Посад", "Фрязино", "Лыткарино", "Дзержинский", "Солнечногорск", "Котельники", "Кашира",
        "Краснознаменск", "Протвино", "Истра"),

    "Санкт-Петербург" => array("Санкт-Петербург"),

    "Краснодарский край" => array("Краснодар", "Сочи", "Анапа", "Новороссийск",
        "Геленджик", "Туапсе", "Ейск", "Армавир", "Кропоткин", "Славянск-на-Кубани"),

    "Челябинская область" => array("Челябинск", "Златоуст"),

    "Чеченская Республика" => array("Грозный", "Аргун", "Гудермес", "Урус-Мартан", "Шали", "Шатой", "Наурская", "Ачхой-Мартан", "Гойты", "Автуры"),

    "Республика Дагестан" => array("Махачкала", "Дербент", "Каспийск", "Хасавюрт", "Буйнакск", "Кизляр", "Южно-Сухокумск", "Хасавюрт", "Избербаш", "Хунзах"),

    "Республика Хакасия" => array("Абакан", "Саяногорск", "Черногорск", "Абаза", "Сорск", "Шира", "Усть-Абакан", "Белый Яр", "Боград", "Таштып"),

    "Республика Саха (Якутия)" => array("Якутск", "Нерюнгри", "Ленск", "Мирный", "Алдан", "Покровск", "Вилюйск", "Олёкминск", "Хандыга", "Маган"),

    "Республика Северная Осетия-Алания" => array("Владикавказ", "Моздок", "Алагир", "Ардон", "Дигора", "Беслан", "Орджоникидзе", "Артёмовск", "Правобережный", "Ираф"),

    "Республика Ингушетия" => array("Назрань", "Магас", "Сунжа", "Малгобек", "Карабулак", "Экажево", "Слободской", "Джейрах", "Алхан-Кала", "Троицкое"),

    "Хабаровский край" => array("Хабаровск", "Комсомольск-на-Амуре", "Амурск", "Бикин", "Вяземский",
        "Николаевск-на-Амуре", "Советская Гавань", "Шимановск", "Аян", "Корфовский"),
        // Добавьте другие регионы и города по вашему выбору
    );

    public static function getAdress()
    {
        $randomRegion = array_rand(Adress::$regions);
        $randomCity = Adress::$regions[$randomRegion][array_rand(Adress::$regions[$randomRegion])];
//
//        echo "Случайный регион: " . $randomRegion . "<br>";
//        echo "Входящий в него город: " . $randomCity;

        return $randomRegion . " " . $randomCity;
    }



//    public static $regions = ["Республика Адыгея", "Республика Бурятия", "Республика Алтай", "Республика Дагестан",
//        "Республика Ингушетия", "Кабардино-Балкарская Республика", "Республика Калмыкия",
//        "Карачаево-Черкесская Республика", "Республика Карелия", "Республика Коми", "Республика Марий Эл",
//        "Республика Мордовия", "Республика Саха (Якутия)", "Республика Северная Осетия-Алания",
//        "Республика Тыва", "Удмуртская Республика", "Республика Хакасия", "Чувашская Республика",
//        "Ставропольский край", "Хабаровский край"];
//
//
//    public function getRegion()
//    {
//        $mass = ["Республика Адыгея ", "Республика Бурятия ", "Республика Алтай ", "Республика Дагестан ",
//            "Республика Ингушетия ", "Кабардино-Балкарская Республика ", "Республика Калмыкия ",
//            "Карачаево-Черкесская Республика ", "Республика Карелия ", "Республика Коми ", "Республика Марий Эл ",
//            "Республика Мордовия ", "Республика Саха (Якутия) ", "Республика Северная Осетия-Алания ",
//            "Республика Тыва ", "Удмуртская Республика ", "Республика Хакасия ", "Чувашская Республика ",
//            "Ставропольский край ", "Хабаровский край "];
////        return $mass[rand(0, 19)];
//        return $mass[rand(0, (count($mass) - 1))];
//    }
//
//
//    public function getCity()
//    {
//        $mass = ["Майкоп", "Горно-Алтайск", "Уфа", "Улан-Удэ", "Махачкала", "Нальчик", "Петразоводск", "Сыктывкар",
//            "Йошкар-Ола", "Саранск", "Якутск", "Владикавказ", "Казань", "Кызыл", "Ижевск", "Абакан", "Грозный",
//            "Чебоксары", "Барнаул", "Чита", "Петропавловск-Камчатский", "Краснодар", "Красноярск", "Пермь",
//            "Ставрополь", "Хабаровск", "Благовещенск", "Архангельск", "Астрахань", "Белгород", "Брянск", "Владимир",
//            "Волгоград", "Вологда", "Воронеж", "Иваново", "Иркутск", "Калининград", "Калуга", "Кемерово", "Киров",
//            "Кострома", "Курган", "Курск", "Липецк", "Магадан", "Москва", "Мурманск", "Нижний Новгород",
//            "Великий Новгород", "Новосибирск", "Омск", "Оренбург", "Орел", "Пенза", "Псков", "Ростов-на-Дону",
//            "Рязань", "Самара", "Саратов", "Южно-Сахалинск", "Екатеринбург", "Смоленск", "Тамбов", "Тверь", "Томск",
//            "Тула", "Тюмень", "Ульяновск", "Челябинск", "Ярославль", "Нарьян-Мар", "Ханты-Мансийск", "Анадырь",
//            "Салехард", "Биробиджан", "Москва"];
//
//        return $mass[rand(0, (count($mass) - 1))];
//    }
//
//
//    public function getStreet()
//    {
//        $mass = ["ул. Ленина", "ул. Пушкина", "ул. Труда", "ул. Молодогвардейцев", "ул. Кирова", "ул. Вавилова", "ул. Павлова", "ул. Семенова",
//            "пр-кт Мира", "ул. Рижская", "ул. Павших революционеров"];
//
//        return $mass[rand(0, (count($mass) - 1))];
//    }
//    return $mass[rand(0, (count($mass) - 1))];
}