<?php


class RndClient
{
//    public static $MAX_INDEX = 56;

    public function getRandIndex()
    {
        return rand(0, 56);
    }

    public function getFam()
    {
        $mass = ["Иванов", "Петров", "Смирнов", "Козлова", "Егоров", "Соколов", "Павлов", "Кузнецова", "Михайлов",
            "Андреева", "Никитин", "Козлов", "Тимофеева", "Сидоров", "Григорьев", "Иванова", "Петрова", "Смирнов",
            "Кузнецов", "Иванова", "Соколова", "Павлов", "Новикова", "Миронов", "Козлова", "Сидоров", "Григорьева",
            "Иванов", "Петрова", "Никитина", "Кузнецов", "Смирнова", "Козлов", "Петров", "Новикова", "Соколов",
            "Михайлова", "Андреев", "Сидорова", "Григорьев", "Иванов", "Петров", "Смирнов", "Кузнецова", "Новиков",
            "Миронова", "Козлов", "Соколова", "Павлова", "Миронов", "Ковалев", "Сидорова", "Иванов", "Никитина",
            "Козлов", "Тимофеев", "Григорьева"];

        return $mass[$this->getRandIndex()];
    }

    public function getName()
    {
        $mass = ["Алексей", "Елена", "Дмитрий", "Мария", "Артем", "Ирина", "Максим", "Екатерина", "Петр", "Ольга",
            "Александр", "Егор", "Виктория", "Анастасия", "Даниил", "Елизавета", "Никита", "Алиса", "Марк", "Мария",
            "Артемида", "Владислав", "Ева", "Арсений", "Анастасия", "Денис", "София", "Степан", "Александра",
            "Иванна", "Макс", "Елизавета", "Марк", "Антон", "Арина", "Владимир", "Ева", "Николай", "Александра",
            "Иван", "Мария", "Артем", "Виктор", "Екатерина", "Максим", "Анна", "Дмитрий", "Анна", "Татьяна",
            "Андрей", "Ангелина", "София", "Глеб", "Алена", "Артем", "Егор", "Валентина"];

        return $mass[$this->getRandIndex()];
    }

    public function getOt()
    {
        $mass = ["Петрович", "Ивановна", "Сергеевич", "Александровна", "Владимирович", "Александровна", "Дмитриевич",
            "Сергеевна", "Андреевич", "Васильевна", "Александрович", "Игоревич", "Денисовна", "Павловна",
            "Артемович", "Ивановна", "Сергеевич", "Владимировна", "Алексеевич", "Петровна", "Игоревна",
            "Александрович", "Викторовна", "Дмитриевич", "Сергеевна", "Алексеевич", "Ивановна", "Петрович",
            "Артемовна", "Сергеевна", "Игоревич", "Алексеевна", "Дмитриевич", "Сергеевич", "Ивановна", "Алексеевич",
            "Денисовна", "Владимирович", "Андреевна", "Александрович", "Ивановна", "Сергеевич", "Артемович",
            "Алексеевна", "Александрович", "Максимовна", "Владимирович", "Ивановна", "Дмитриевна", "Васильевич",
            "Андреевна", "Данииловна", "Павлович", "Максимовна", "Игоревич", "Артемович", "Ивановна"];

        return $mass[$this->getRandIndex()] . " ";
    }


    public function getDocument()
    {
        return "паспорт РФ ";
    }


    public function getDocumentseries()
    {
        return rand(1, 9999) . " ";
    }


    public function getDocumentnumber()
    {
        return rand(1, 999999) . " ";
    }


    public function getDateofbirth()
    {
        $mass = ["01.01.1980", "15.05.1992", "03.07.1985", "20.12.1979", "28.09.1990", "09.07.1982", "15.11.1995",
            "28.05.1987", "03.12.1976", "18.04.1990", "22.09.1985", "27.03.1983", "12.01.1999", "29.08.1975",
            "05.06.1980", "16.12.1992", "21.02.1988", "07.04.1996", "10.10.1981", "14.05.1993", "25.09.1984",
            "01.03.1979", "11.11.1991", "05.07.1987", "29.12.1980", "18.04.1978", "06.08.1995", "09.01.1983",
            "17.11.1990", "21.03.1986", "30.05.1977", "26.09.1989", "04.07.1994", "15.12.1981", "09.11.1997",
            "22.10.1980", "18.04.1996", "07.07.1982", "13.09.1990", "19.11.1985", "02.06.1998", "25.12.1983",
            "10.08.1979", "28.05.1982", "15.10.1991", "05.07.1996", "17.12.1981", "14.09.1998", "28.03.1993",
            "19.07.1986", "09.02.1997", "03.11.1991", "23.05.1984", "30.08.1994", "17.06.1987", "11.12.1982",
            "26.07.1989"];

        return $mass[$this->getRandIndex()] . " ";
    }


    public function getEmail()
    {

    }


    public function getPatientstatus()
    {

    }


    public function getRegistrationdate()
    {

    }


    public function getCountry()
    {

    }


    public function getRegion()
    {

    }


    public function getCity()
    {

    }


    public function getStreet()
    {

    }


    public function getGender()
    {

    }


    public function getPlaceofbirth()
    {

    }


    public function getReferralsource()
    {

    }


    public function getReferringdoctor()
    {

    }


}