<?php

require_once "Adress.php";

class RndClient
{

    public function getId()
    {
        $person_id = "29" . rand(4, 5);
        for ($i = 1; $i <= 3; $i++)
        {
            $person_id .= rand(0, 9);
        }
        return $person_id;
    }

    public function getCardNum()
    {
        $cardNum = rand(1, 9);
        for ($i = 1; $i <= rand(3, 5); $i++)
        {
            $cardNum .= rand(0, 9);
        }
        return $cardNum;
    }

    public function getFam($gender)
    {

        $male = ["Петров", "Егоров", "Михайлов", "Никитин", "Козлов", "Кузнецов", "Павлов",
            "Миронов", "Сидоров", "Кузнецов", "Соколов", "Андреев", "Григорьев", "Смирнов",
            "Новиков", "Ковалев", "Иванов", "Тимофеев", "Штирлиц"
        ];
        $female = ["Кузнецова", "Андреева", "Тимофеева", "Иванова", "Соколова", "Козлова", "Петрова",
            "Смирнова", "Новикова", "Михайлова", "Сидорова", "Миронова", "Павлова", "Никитина", "Григорьева",
            "Подошва"
        ];

        if ($gender) return $male[rand(0, (count($male) - 1))];
        else return $female[rand(0, (count($female) - 1))];
    }

    public function getName($gender)
    {
        $male = ["Алексей", "Дмитрий", "Артем", "Максим", "Петр", "Александр", "Егор", "Даниил", "Марк", "Владислав",
            "Арсений", "Денис", "Степан", "Макс", "Антон", "Владимир", "Николай", "Иван", "Виктор", "Андрей",
            "Изя", "Мухамед", "Абрам", "Моня", "Глеб", "Моня", "Моисей", "Шрага-Гога"
        ];
        $female = ["Елена", "Мария", "Ирина", "Екатерина", "Ольга", "Виктория", "Анастасия", "Елизавета", "Алиса", "Артемида",
            "Ева", "София", "Александра", "Иванна", "Арина", "Анна", "Татьяна", "Ангелина", "Алена", "Валентина",
            "Психея"];

        if ($gender) return $male[rand(0, (count($male) - 1))];
        else return $female[rand(0, (count($female) - 1))];
    }

    public function getOt($gender)
    {
        $male = ["Петрович", "Сергеевич", "Владимирович", "Дмитриевич", "Андреевич", "Александрович", "Игоревич", "Артемович",
            "Алексеевич", "Васильевич", "Павлович", "Моисеевич", "Абрамович", "Мордехаевич"
        ];
        $female = ["Ивановна", "Александровна", "Сергеевна", "Васильевна", "Денисовна", "Павловна", "Владимировна",
            "Петровна", "Игоревна", "Викторовна", "Артемовна", "Алексеевна", "Андреевна", "Максимовна", "Дмитриевна",
            "Данииловна"
        ];

        if ($gender) return $male[rand(0, (count($male) - 1))];
        else return $female[rand(0, (count($female) - 1))];
    }


    public function getDocument()
    {
        return "паспорт РФ";
    }


    public function getDocumentseries()
    {
        return
            rand(0, 9) .
            rand(0, 9) .
            rand(0, 9) .
            rand(0, 9);
    }


    public function getDocumentnumber()
    {
        return
            rand(0, 9) .
            rand(0, 9) .
            rand(0, 9) .
            rand(0, 9) .
            rand(0, 9) .
            rand(0, 9);
    }


    public function getDateofbirth()
    {
        $mass = ["01.01.1980", "15.05.1992", "03.07.1985", "20.12.1979", "28.09.1990", "09.07.1982", "15.11.1995",
            "28.05.1987", "03.12.1976", "18.04.1990", "22.09.1985", "27.03.1983", "12.01.1999", "29.08.1975",
            "05.06.1980", "16.12.1992", "21.02.1988", "07.04.1996", "10.10.1981", "14.05.1993", "25.09.1984",
            "01.03.1979", "11.11.1991", "05.07.1987", "29.12.1980", "18.04.1978", "06.08.1995", "09.01.1983",
            "17.11.1990", "21.03.1986", "30.05.1977", "26.09.1989", "04.07.1994", "15.12.1981", "09.11.1997",
            "22.10.1980", "18.04.1996", "07.07.1982", "13.09.1990", "19.11.1985", "02.06.1998", "25.12.1983",
            "10.08.1979", "28.05.1982", "15.10.1991", "05.07.1996", "17.12.1981", "14.09.1998", "28.03.1993",
            "19.07.1986", "09.02.1997", "03.11.1991", "23.05.1984", "30.08.1994", "17.06.1987", "11.12.1982",
            "26.07.1989"];

//        return $mass[$this->getRandIndex()] . " ";
        return $mass[rand(0, (count($mass) - 1))];
    }


    public function getEmail()
    {
        $email = "";
        for ($i = 1; $i <= rand(4, 8); $i++)
        {
            $email .= chr(rand(97, 122));
        }

        $email .= "@";
        $mass = ["tymbler.ru", "jandex.ru", "fail.com", "gfail.com"];

        return $email . $mass[rand(0, (count($mass) - 1))];
    }

    public function getPhone()
    {
        $phone = "+7 (9";
        $phone .= rand(0, 9) . rand(0, 9) . ") ";
        $phone .= rand(0, 9) . rand(0, 9) . rand(0, 9) . " ";
        $phone .= rand(0, 9) . rand(0, 9) . " ";
        $phone .= rand(0, 9) . rand(0, 9);
        return $phone;
    }


    public function getPatientstatus()
    {
        $mass = ["Коммерческий", "ОМС", "СМ", "СМ клиники", "А/ДЯ", "ДС"];
        return $mass[rand(0, (count($mass) - 1))];
    }

    /**
     * Одинока ли
     * @return string
     */
    public function isLonely()
    {
        $mass = ["Одиночка", "Не одиночка"];
        return $mass[rand(0, (count($mass) - 1))];
    }


    public function getRegistrationdate()
    {
        $mass = ["15.10.2023", "20.09.2023", "05.11.2023", "18.08.2023", "25.07.2023", "20.06.2023",
            "05.03.2023", "12.09.2023", "15.11.2023", "08.08.2023", "30.07.2023", "25.05.2023", "10.02.2023",
            "18.04.2023", "22.10.2023", "14.07.2023", "29.09.2023", "25.03.2023", "17.11.2023", "30.08.2023",
            "19.04.2023", "07.06.2023", "23.09.2023", "11.02.2023", "16.10.2023", "28.07.2023", "05.05.2023",
            "20.09.2023", "14.06.2023", "02.12.2023", "10.03.2023", "18.08.2023", "25.04.2023", "29.09.2023",
            "07.06.2023", "16.03.2023", "25.11.2023", "20.08.2023", "14.07.2023", "30.09.2023", "10.04.2023",
            "22.11.2023", "18.03.2023", "07.07.2023", "23.09.2023", "11.02.2023", "16.10.2023", "21.06.2023",
            "04.01.2023", "30.04.2023", "15.03.2023", "12.12.2023", "18.10.2023", "25.07.2023", "05.09.2023",
            "28.08.2023", "10.03.2023"];
//        return $mass[$this->getRandIndex()] . " ";
        return $mass[rand(0, (count($mass) - 1))];
    }


    public function getCountry()
    {
        return "Россия";
    }

    public function getRegion()
    {
        return Adress::getAdressSimple();
    }


    public function getCity()
    {
        $mass = ["Майкоп", "Горно-Алтайск", "Уфа", "Улан-Удэ", "Махачкала", "Нальчик", "Петразоводск", "Сыктывкар",
            "Йошкар-Ола", "Саранск", "Якутск", "Владикавказ", "Казань", "Кызыл", "Ижевск", "Абакан", "Грозный",
            "Чебоксары", "Барнаул", "Чита", "Петропавловск-Камчатский", "Краснодар", "Красноярск", "Пермь",
            "Ставрополь", "Хабаровск", "Благовещенск", "Архангельск", "Астрахань", "Белгород", "Брянск", "Владимир",
            "Волгоград", "Вологда", "Воронеж", "Иваново", "Иркутск", "Калининград", "Калуга", "Кемерово", "Киров",
            "Кострома", "Курган", "Курск", "Липецк", "Магадан", "Москва", "Мурманск", "Нижний Новгород",
            "Великий Новгород", "Новосибирск", "Омск", "Оренбург", "Орел", "Пенза", "Псков", "Ростов-на-Дону",
            "Рязань", "Самара", "Саратов", "Южно-Сахалинск", "Екатеринбург", "Смоленск", "Тамбов", "Тверь", "Томск",
            "Тула", "Тюмень", "Ульяновск", "Челябинск", "Ярославль", "Нарьян-Мар", "Ханты-Мансийск", "Анадырь",
            "Салехард", "Биробиджан", "Москва"];

        return $mass[rand(0, (count($mass) - 1))];
    }


    public function getStreet()
    {
        $mass = ["ул. Ленина", "ул. Пушкина", "ул. Труда", "ул. Молодогвардейцев", "ул. Кирова", "ул. Вавилова",
            "ул. Павлова", "ул. Семенова",
            "пр-кт Мира", "ул. Рижская", "ул. Павших революционеров"];

        return $mass[rand(0, (count($mass) - 1))];
    }

    /**
     * true - М
     * false - Ж
     * @param $gender boolean
     * @return string "М" или "Ж"
     */
    public function getGender($gender)
    {
        if ($gender) return "М";
        return "Ж";
    }


    public function getPlaceofbirth()
    {
        $mass = ["Москва", "СССР", "Стерлитамак", "Франция", "Германия", "Дмитровград", "село Дубки", "США", "Казань",
            "Екатеринбург", "Мурманск", "Севастопль", "Киев", "Ленинградская область"];
        return $mass[rand(0, (count($mass) - 1))];
    }


    public function getReferralsource()
    {
        $mass = ["из интернета", "ВК", "Телеграм", "Новости", "Знакомые", "От врача", "Телевизор", "Из газеты"];
        return $mass[rand(0, (count($mass) - 1))];
    }


    public function getReferringdoctor()
    {
        $mass = ["Конев А.Г.", "Тверд И.И.", "Швецов П.Р", "Иванов В.В.", "Палкин Р.А.", "Ермолин М.К.",
            "Денисов Д.Ж.", "Пальцев М.В."];
        return $mass[rand(0, (count($mass) - 1))];
    }


}