<?php
require_once "Adress.php";
require_once "RndClient.php";


$mass = ["Петрович", "Ивановна", "Сергеевич", "Александровна", "Владимирович", "Дмитриевич", "Сергеевна",
    "Андреевич", "Васильевна", "Александрович", "Игоревич", "Денисовна", "Павловна", "Артемович", "Владимировна",
    "Алексеевич", "Петровна", "Игоревна", "Викторовна", "Артемовна", "Алексеевна", "Андреевна", "Максимовна",
    "Дмитриевна", "Васильевич", "Данииловна", "Павлович"];


//$mass = array_unique($mass);
//
//foreach ($mass as $item)
//{
//    echo $item . '<BR>';
//}

$male = ["Петрович", "Сергеевич", "Владимирович", "Дмитриевич", "Андреевич", "Александрович", "Игоревич", "Артемович",
    "Алексеевич", "Васильевич", "Павлович"
];
$female = ["Ивановна", "Александровна", "Сергеевна", "Васильевна", "Денисовна", "Павловна", "Владимировна",
    "Петровна", "Игоревна", "Викторовна", "Артемовна", "Алексеевна", "Андреевна", "Максимовна", "Дмитриевна",
    "Данииловна"
];

foreach ($mass as $name)
{
    if (preg_match('/а$/', $name))
    {
        $female[] = $name;
    } else
    {
        $male[] = $name;
    }
}

foreach ($male as $item)
{
    echo $item . '<BR>';
}
//
//Adress::getAdress();